SpringFramework.tex
% Created 2021-07-19 Mon 09:55
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jonathan Fairbanks}
\date{\today}
\title{Innovation week : Spring Framework Summary}
\hypersetup{
 pdfauthor={Jonathan Fairbanks},
 pdftitle={Innovation week : Spring Framework Summary},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Spring Framework}
\label{sec:orgd190ac7}
\subsection{Spring overview}
\label{sec:org60bc6db}
Spring is a IoC (Inversion of Control) framework which is a design pattern that has the intention of removing dependencies from your code.

Examples often showing between an object being isntantiated via setter or a constructor .
\subsection{AOP (Aspect Oriented Programming)}
\label{sec:orgd45b2b0}
Spring is also what is called a Aspect oriented framework which means it seperates things out in a way. (described as cross cutting concerns) an example is having something like logging being part of the application running and the ``business'' logic written somewhere else.
\subsection{Beans}
\label{sec:orga5cc3c3}
Beans are objects that are managed by Spring
\section{JPA (Java Persistence API)}
\label{sec:orge19884e}
\subsection{Defining Entities (Models)}
\label{sec:org4c4b611}
Entities are persistent domain objects that usually represent a table in a database. and each instance of an entity corresponds with a row.
\subsubsection{Decorators}
\label{sec:org1c74d63}
\begin{enumerate}
\item @Entity
\label{sec:orgb5aa77c}
Decorator that is placed over a class definition. which marks the object as a JPA Entity
\item @Id
\label{sec:orga0bf317}
The decorator that lets JPA know which of the objects ID is is its ID (Usually a Long or some other number)
\item @GeneratedValue [1]
\label{sec:orgf9f9838}
This is paired with the @Id decorator and lets JPA know how the ID should be generated. ex: @GeneratedValue(strategy=GenerationType.AUTO)

if this decorator is ommited it will selected AUTO as its generation type

\begin{enumerate}
\item AUTO
\label{sec:org68957d7}
The default generation type and will be based on the persistence provider.
\item IDENTITY
\label{sec:org4a3274c}
Relies on an auto incremented database column and generates a new value for each insert operation. Not a good option for hibernate as it requires the insert immedietly reducing performance.
\item SEQUENCE
\label{sec:org1c0cc2b}
uses a database sequence to generate unique values, but requires an additonal select statement when doing so. via use of the @SequenceGenerator(x=``'',y=``'') or if that is ommitted it will request the next value from the default sequence.
\item TABLE
\label{sec:orga575271}
simulates sequence by using by using transactional locks which will reduce performance, use SEQUENCE if DB supports it
\end{enumerate}
\item @SequenceGenerator
\label{sec:orga24716c}
you can optionally specifiy additional arguments to
\item @Column
\label{sec:orgb79dc50}
good practice to specify the name of a column in a table, can also specify the properties of a column

\begin{center}
\begin{tabular}{lll}
Identifier & Data Type & Default\\
\hline
name & String & ``''\\
insertable & Boolean & true\\
length & int & 255\\
precision & int & 0\\
scale & int & 0\\
nullable & Boolean & true\\
columnDefinition & String & ``''\\
unique & Boolean & false\\
updatable & Boolean & true\\
\end{tabular}
\end{center}


\begin{enumerate}
\item name : just the name of the column
\label{sec:orgde2343c}
\item insertable : whether SQL insert statements can be used
\label{sec:org8beba85}
\item length : column length
\label{sec:orgc512c11}
\item precision : decimal precision
\label{sec:org5a0d0e4}
\item scale : scale for a decimal column
\label{sec:org58b0374}
\item nullable : Defines if it is nullable
\label{sec:org8e0b15c}
\item columnDefinition : change definition ex: varChar(256)
\label{sec:org92ee1d8}
\item unique : if it has a uniqueness constraint
\label{sec:org1a1b3e2}
\item updatable : if SQL update statements can be used on it
\label{sec:orga64fdef}
\end{enumerate}
\end{enumerate}

\subsubsection{Entity Requirements [2]}
\label{sec:org0f8d449}
\begin{enumerate}
\item Declared with @Entity
\label{sec:org4b39d84}
\item has a public/protected no args constructor
\label{sec:orgd9479fe}
\item Class, methods, and variables must not be declared Final
\label{sec:orgc7ac2da}
\item Persistence variables must be private/protected and can only be modified by the entities methods
\label{sec:org0ecafd8}
\item Entities can extend or be extended by non entity classes
\label{sec:org1ef536e}
\item If an entity is passed by value as a detached object the class needs to implement serializable
\label{sec:org9255feb}
\end{enumerate}

\subsubsection{Example from \url{https://spring.io/guides/gs/accessing-data-jpa/\#initial}:}
\label{sec:org6aa5f84}
\begin{java}
package com.example.accessingdatajpa;

import javax.persistence.Entity;
import javax.persistence.GeneratedValue;
import javax.persistence.GenerationType;
import javax.persistence.Id;

@Entity
public class Customer \{

@Id
@GeneratedValue(strategy=GenerationType.AUTO)
private Long id;
private String firstName;
private String lastName;

protected Customer() \{\}

public Customer(String firstName, String lastName) \{
  this.firstName = firstName;
  this.lastName = lastName;
\}

@Override
public String toString() \{
  return String.format(
      ``Customer[id=\%d, firstName='\%s', lastName='\%s']'',
      id, firstName, lastName);
\}

public Long getId() \{
  return id;
\}

public String getFirstName() \{
  return firstName;
\}

  public String getLastName() \{
    return lastName;
  \}
\}
\end{java}

\subsection{Join Types}
\label{sec:org59aab51}
\subsection{Creating Queries}
\label{sec:org1acf66a}
the repository implementations are created automatically from an interface
the interface incldues methods for saving, deleting and finding customer entities.

with this this implementation of it does not need to be written after you write the interface.

\subsubsection{Example from \url{https://spring.io/guides/gs/accessing-data-jpa/\#initial}:}
\label{sec:orgb25b336}
\begin{java}
package com.example.accessingdatajpa;

import java.util.List;
import org.springframework.data.repository.CrudRepository;

public interface CustomerRepository extends CrudRepository<Customer, Long> \{

List<Customer> findByLastName(String lastName);

  Customer findById(long id);
\}
\end{java}
\section{DSL Query}
\label{sec:org2a18ecb}

\section{MasterControl}
\label{sec:org0a65320}

\section{Docs}
\label{sec:org637f899}
\subsection{\url{https://docs.spring.io/spring-framework/docs/current/reference/html/}}
\label{sec:org5052161}
\subsection{\url{https://www.tutorialspoint.com/spring/spring\_overview.htm}}
\label{sec:org2d9ff77}
\section{Good Stack overflow pages}
\label{sec:orgf675903}
\subsection{[1] \url{https://stackoverflow.com/questions/47676403/spring-generatedvalue-annotation-usage}}
\label{sec:org7ee3707}
\subsection{[2] \url{https://stackoverflow.com/questions/63414381/what-is-entity-in-spring-jpa}}
\label{sec:org0c6e763}
\subsection{[3] \url{https://stackoverflow.com/questions/3058/what-is-inversion-of-control}}
\label{sec:org4b89602}
\subsection{[4] \url{https://stackoverflow.com/questions/2990799/difference-between-fetchtype-lazy-and-eager-in-java-persistence-api}}
\label{sec:org86e245e}
\end{document}
